OSabuser/mimxrt1052-ci-cd/board/pin_mux.c
/*
** Akimov Dmitry 2024 MU LLC
*/
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052CVJ5B
mcu_data: ksdk2_0
processor_version: 15.0.1
pin_labels:
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: LED1, identifier: FlexSPI_D0_B;ALIVE_LED}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: LED2, identifier: FlexSPI_CLK_B;PROCESS_LED}
- {pin_num: L4, pin_signal: GPIO_SD_B1_07, label: USER_0, identifier: FlexSPI_CLK;TEST_PIN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: K14, peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_12, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_6, slew_rate: Slow}
  - {pin_num: L14, peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_13}
  - {pin_num: M4, peripheral: GPIO3, signal: 'gpio_io, 03', pin_signal: GPIO_SD_B1_03, identifier: ALIVE_LED, direction: OUTPUT, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: P2, peripheral: GPIO3, signal: 'gpio_io, 04', pin_signal: GPIO_SD_B1_04, identifier: PROCESS_LED, direction: OUTPUT, pull_up_down_config: Pull_Up_47K_Ohm}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  /* GPIO configuration of ALIVE_LED on GPIO_SD_B1_03 (pin M4) */
  gpio_pin_config_t ALIVE_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_03 (pin M4) */
  GPIO_PinInit(GPIO3, 3U, &ALIVE_LED_config);

  /* GPIO configuration of PROCESS_LED on GPIO_SD_B1_04 (pin P2) */
  gpio_pin_config_t PROCESS_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_04 (pin P2) */
  GPIO_PinInit(GPIO3, 4U, &PROCESS_LED_config);

#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 3)
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TXD,       /* GPIO_AD_B0_12 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#else
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TX,        /* GPIO_AD_B0_12 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif
#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 3)
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_13_LPUART1_RXD,       /* GPIO_AD_B0_13 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#else
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_13_LPUART1_RX,        /* GPIO_AD_B0_13 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_03_GPIO3_IO03,        /* GPIO_SD_B1_03 is configured as GPIO3_IO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_04_GPIO3_IO04,        /* GPIO_SD_B1_04 is configured as GPIO3_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 3)
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TXD,       /* GPIO_AD_B0_12 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Keep the previous output value when the output driver is disabled.
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled (CMOS input) */
#else
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_12_LPUART1_TX,        /* GPIO_AD_B0_12 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Keep the previous output value when the output driver is disabled.
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled (CMOS input) */
#endif
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_03_GPIO3_IO03,        /* GPIO_SD_B1_03 PAD functional properties : */
      0x50B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Keep the previous output value when the output driver is disabled.
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled (CMOS input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_04_GPIO3_IO04,        /* GPIO_SD_B1_04 PAD functional properties : */
      0x50B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Keep the previous output value when the output driver is disabled.
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled (CMOS input) */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
